In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# if you do not have write access to this path, you may need 
# to change it to a path that you do have write access to.
gdrivePath="/content/drive/MyDrive/"
import sqlite3
import pandas as pd
# create a connection to a database
conn = sqlite3.connect(gdrivePath+"Edinburgh_Buses.db")

In [ ]:
def execSQL(conn,query):
  conn.execute(query) # execute an SQL query
  conn.commit() # "commit" that query in order to make its action permanent

In [ ]:
def allrowsSelect(conn,query):
  cursor = conn.execute(query)
  for row in cursor:
   print(row)

In [ ]:
import pandas as pd
pd.read_sql_query('select * from route where company="LRT"',conn)

    num company  pos  stop
0     1     LRT    1   137
1     1     LRT    2    99
2     1     LRT    3    59
3     1     LRT    4    66
4     1     LRT    5    42
..   ..     ...  ...   ...
687   9     LRT    5    37
688   9     LRT    6    99
689   9     LRT    7   105
690   9     LRT    8   162
691   9     LRT    9   215

[692 rows x 4 columns]

In [ ]:
#Write a query to find all of the distinct bus companies.
allrowsSelect(conn,"select * from pragma_table_info('route')")

(0, 'num', 'VARCHAR(3)', 0, None, 0)
(1, 'company', 'VARCHAR(3)', 0, None, 0)
(2, 'pos', 'INTEGER', 0, None, 0)
(3, 'stop', 'INTEGER', 0, None, 0)

In [ ]:
query = """select distinct company from route"""
allrowsSelect(conn,query)

('LRT',)
('MAC',)
('SMT',)
('SMJ',)
('CCC',)
('MID',)
('LOW',)
('LRJ',)
('WIL',)
('FS',)
('FF',)
('JM',)
('ROU',)
('VL',)

In [ ]:
#Write a query that lists all of the distinct route number and company combinations.
query = """select distinct company, num from route"""
allrowsSelect(conn,query)

('LRT', '1')
('LRT', '10')
('LRT', '100')
('MAC', '100')
('SMT', '106')
('LRT', '11')
('SMT', '113')
('LRT', '12')
('SMT', '124')
('SMT', '129')
('LRT', '13')
('SMT', '134')
('SMT', '137')
('LRT', '14')
('SMJ', '142')
('LRT', '15')
('LRT', '16')
('SMT', '16')
('LRT', '17')
('SMT', '18')
('LRT', '19')
('SMT', '19')
('LRT', '19A')
('LRT', '2')
('LRT', '20')
('LRT', '21')
('LRT', '22')
('LRT', '22A')
('LRT', '23')
('LRT', '24')
('LRT', '25')
('CCC', '251')
('LRT', '26')
('LRT', '26A')
('LRT', '27')
('MID', '27')
('SMT', '275')
('LRT', '28')
('LOW', '29')
('LRT', '2A')
('LRT', '3')
('LOW', '30')
('LRT', '30')
('LRT', '31')
('LOW', '315')
('LRT', '32')
('LRT', '33')
('LRT', '34')
('LRT', '35')
('LRT', '36')
('LRT', '37')
('SMT', '37')
('LRT', '38')
('MID', '38')
('LRJ', '3A')
('LRT', '4')
('LRT', '40')
('LRT', '41')
('LRT', '42')
('LRT', '43')
('SMT', '43')
('LRT', '44')
('LRT', '45')
('MID', '455')
('LRT', '46A')
('LRT', '47')
('MID', '47')
('WIL', '48')
('SMT', '49')
('LRT', '5')
('LRT', '51')
('LRT', '52')
('FS', '53')
('FS', '55')
('LRT', '55')
('FF', '56')
('LRT', '58')
('LRT', '59')
('LRT', '6')
('JM', '60')
('LRT', '61')
('SMT', '61')
('LOW', '62')
('LRT', '63')
('SMT', '64')
('SMT', '64A')
('LRT', '65')
('SMT', '65')
('SMT', '66')
('SMT', '66A')
('LRT', '69')
('LRT', '7')
('SMT', '74')
('LRT', '75')
('SMT', '77')
('SMT', '79')
('LRT', '7A')
('LRT', '8')
('LRT', '80')
('SMT', '80')
('LRT', '80A')
('LRT', '80B')
('LRT', '81')
('LRT', '81A')
('LRT', '82')
('LRT', '84')
('LRT', '85')
('SMT', '85')
('LRT', '86')
('SMT', '86')
('LRT', '86A')
('LRT', '87')
('SMT', '87')
('LRT', '87A')
('LRT', '9')
('SMT', '93')
('LOW', '94')
('LOW', '95')
('SMT', 'A8')
('SMT', 'C12')
('SMT', 'C3')
('SMT', 'C33')
('SMT', 'C5')
('SMT', 'C55')
('SMT', 'C70')
('SMT', 'D25')
('SMT', 'D26')
('SMT', 'D27')
('SMT', 'D28')
('ROU', 'R1')
('ROU', 'R2')
('VL', 'VL2')

In [ ]:
#Write a query to find the route numbers that are used by more than one company, and the number of times that they are used.
query = """select num, count(distinct company) as count from route group by num having count > 1"""
allrowsSelect(conn, query)

('100', 2)
('16', 2)
('19', 2)
('27', 2)
('30', 2)
('37', 2)
('38', 2)
('43', 2)
('47', 2)
('55', 2)
('61', 2)
('65', 2)
('80', 2)
('85', 2)
('86', 2)
('87', 2)

In [ ]:
#Write a query to find the names of all of the stops on route 17 operated by company LRT, ordered by position. 
query='''
select route.pos, route.stop, stops.name
	from route 
	inner join stops on route.stop = stops.id
	where route.company == "LRT" and route.num == 17
	order by route.pos
'''  
allrowsSelect(conn, query)

(1, 167, 'Newhaven')
(2, 137, 'Leith')
(3, 141, 'Leith Walk')
(4, 194, 'Princes Street')
(5, 230, 'Tollcross')
(6, 160, 'Morningside')
(7, 179, 'Oxgangs')

In [ ]:
#Write a query that counts how many distinct routes each company has
query = """select company, count(distinct num) from route group by company"""
allrowsSelect(conn,query)

('CCC', 1)
('FF', 1)
('FS', 2)
('JM', 1)
('LOW', 6)
('LRJ', 1)
('LRT', 72)
('MAC', 1)
('MID', 4)
('ROU', 2)
('SMJ', 1)
('SMT', 38)
('VL', 1)
('WIL', 1)

In [ ]:
#Write a query to find all of the distinct routes operated by company "LOW"
query = """select distinct num from route where company = 'LOW'"""
allrowsSelect(conn,query)

('29',)
('30',)
('315',)
('62',)
('94',)
('95',)

In [ ]:
#Ten routes with the most stops

query = """select distinct num, company, count(stop) as count from route group by num, company order by count desc limit 10"""

allrowsSelect(conn,query)

('32', 'LRT', 23)
('52', 'LRT', 23)
('12', 'LRT', 18)
('2A', 'LRT', 18)
('2', 'LRT', 17)
('34', 'LRT', 15)
('35', 'LRT', 15)
('66A', 'SMT', 13)
('81A', 'LRT', 13)
('14', 'LRT', 12)

In [ ]:
#Ten routes with the fewest stops.
query = """select distinct num, company, count(stop) as count from route group by num, company order by count asc limit 10"""

allrowsSelect(conn,query)

('60', 'JM', 2)
('59', 'LRT', 3)
('100', 'LRT', 4)
('48', 'WIL', 4)
('55', 'LRT', 4)
('86A', 'LRT', 4)
('93', 'SMT', 4)
('VL2', 'VL', 4)
('49', 'SMT', 5)
('58', 'LRT', 5)

In [ ]:
#Routes that have the same stop more than once
query = """
create view same_stop3 as 
select num, company, stop, 
count(stop) as count
from route
group by num, company, stop
having count > 1
"""
execSQL(conn, query)

In [ ]:
query = """select * from same_stop3"""
allrowsSelect(conn, query)

('1', 'LRT', 137, 2)
('12', 'LRT', 31, 2)
('12', 'LRT', 115, 2)
('12', 'LRT', 173, 2)
('14', 'LRT', 215, 2)
('19', 'LRT', 28, 2)
('19A', 'LRT', 28, 2)
('2', 'LRT', 31, 2)
('2', 'LRT', 115, 2)
('2', 'LRT', 173, 2)
('275', 'SMT', 48, 2)
('275', 'SMT', 165, 2)
('2A', 'LRT', 31, 2)
('2A', 'LRT', 115, 2)
('2A', 'LRT', 173, 2)
('32', 'LRT', 173, 2)
('34', 'LRT', 92, 2)
('34', 'LRT', 213, 2)
('35', 'LRT', 92, 2)
('35', 'LRT', 213, 2)
('42', 'LRT', 36, 2)
('46A', 'LRT', 36, 2)
('52', 'LRT', 173, 2)
('6', 'LRT', 137, 2)
('81', 'LRT', 47, 2)
('81', 'LRT', 59, 2)
('81', 'LRT', 162, 2)
('81', 'LRT', 219, 2)
('81A', 'LRT', 47, 2)
('81A', 'LRT', 59, 2)
('81A', 'LRT', 162, 2)
('81A', 'LRT', 219, 2)
('R1', 'ROU', 106, 2)
('R2', 'ROU', 106, 2)

In [ ]:
#ten stops on the most routes and how many routes they're on
query = """select stop, count(stop) from 
(select distinct stop, num, company 
from route
inner join stops on route.stop = stops.id
) 
group by stop
order by count(stop) desc
limit 10
"""
allrowsSelect(conn, query)

(219, 47)
(115, 42)
(194, 38)
(29, 36)
(48, 27)
(149, 25)
(101, 20)
(137, 20)
(163, 20)
(213, 20)

In [ ]:
#routes from 219 to 115
query = """
  select num, company from
  (select a.stop, b.stop, a.num, a.company
  from route a, route b
  where a.num = b.num and a.company = b.company and a.stop == 219 and b.stop == 115 )
"""
allrowsSelect(conn, query)

('137', 'SMT')
('22', 'LRT')
('22A', 'LRT')
('25', 'LRT')
('37', 'SMT')
('38', 'MID')
('61', 'LRT')
('61', 'SMT')
('63', 'LRT')
('C12', 'SMT')